<a href="https://colab.research.google.com/github/yeokyungkim/hello-world-/blob/main/homework_nataliakim.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#Homework_1_cakes_assignment
number_of_cake = 3


#testing if number of cake is greater than 4
if number_of_cake > 4:
  print("Everybody is happy.")

#testing if number of cake is equal to 4
elif number_of_cake == 4:
 print("We are not happy.")
else:
  print("We are not happy.")

We are not happy.

In [ ]:
#Homework_1_cakes_assignment
number_of_cake = 3

#testing if number of cake is greater than 4
if number_of_cake > 4:
  print("Everybody is happy.")

#testing if number of cake is equal or less than 4
elif number_of_cake < 4 or number_of_cake == 4:
    print("We are not happy.")

We are not happy.

In [ ]:
#Homework_1_cakes_assignment
number_of_cake = 4

#if you have exactly 4 or less than 4 cakes
if number_of_cake <= 4:
  print("We are not happy.")

#if above conditions is not met
else: 
  print("Everbody is happy.")

We are not happy.

In [ ]:
#Homework_1_cakes_assignment
number_of_cake = 5

if number_of_cake > 4:
  print ("Everyone is happy.")
else:
  print ("We are not happy.")

#if number of cakes is greater than number of student 
  if number_of_cake == 4:
   print("Even though we have 4 cakes, we are still not happy.")

Everyone is happy.

In [ ]:
#Homework_2_cakes_assignment

number_of_cake = 3
number_of_student = 4

#substraction to calculate extra number of cake 
extra_number_of_cake = sub = number_of_cake - number_of_student

#testing if number of cake is greater than 4
if number_of_cake > number_of_student:
  #if true, print below
  print("Everybody is happy.")
  #if false, print below
elif number_of_cake == number_of_student:
  print("We are not happy.")
else:
  print("We are not happy.")


#If there is extra cakes, how many more people can we feed in the classroom? 

if number_of_cake > number_of_student:
  print("If there is" + " " + str(number_of_cake) + " " + "cakes," + " " + "we can feed" + " " + str(sub) + " " + "more people.")

We are not happy.

In [ ]:
# Class Exercise about Loop and Titanic
num = float(input("Enter the number:"))
num = 1
while num < 123:
  print("Passenger" + " " + str(num))
  num = num + 1
print("Passenger" + " " + str(num))

In [ ]:
# Class Exercise about Loop and Titanic_revision

#use the loop method to show the list of passengers on the passenger list
total_number_of_passengers = float(input("Enter the number of passengers:"))

passenger_incrementing = 1
# number of passengers is less than the total number of passengers on the boat
while passenger_incrementing < total_number_of_passengers:
  print("Passenger" + " " + str(passenger_incrementing))
  passenger_incrementing = passenger_incrementing + 1
print("Passenger" + " " + str(passenger_incrementing))

**Homework 3.0 - while** 
-> Request the user to type a number (any positive number) -> decrease is value until 0 (12,11,10, .... 0) 
-> Verify that your program doesn't bug if the user type a negative number (you input a negative number)

In [ ]:
#Homework_3_while

#Ask user to type a random number
number = float(input("Type the number:"))

#number value will decrease by 1 until it reaches 0 and print the number
while number > 0: 
 print(int(number))
 number = number - 1
 
 #if user inputs a number less than 1, system will not generate any more number
 if number <= 0:
   print("0")
   break

Type the number:0

**Homework 4.0** - For from list of ingredients here, create a recipe asking to add all the ingredients to the plate.

ingredient_list = ["apple", "sugar", "lemon", "yogurt", "flour"] -> "add the apple, the sugar, ..." and that is flexible to the number of ingredients

In [7]:
#Homework_4_for_ver 1

#create the ingredient list
ingredient_list = ["apple", "sugar", "lemon", "yogurt", "flour"]

#list all the ingredients on the list and stop. 

print("Add the " + ingredient_list[0] + ", " + ingredient_list[1] + ", " + ingredient_list[2] + ", " + ingredient_list[3] + ", " + ingredient_list[4] +".")
#print("Add the " + str(ingredient_list))

Add the apple, sugar, lemon, yogurt, flour.

In [ ]:
#Homework_4_for_ver 2

#create the ingredient list
ingredient_list = ["apple", "sugar", "lemon", "yogurt", "flour"]

#list all the ingredients on the list and stop. 
for ingredient in ingredient_list:
  print("Add the " + str(ingredient) + ".")

Add the apple.
Add the sugar.
Add the lemon.
Add the yogurt.
Add the flour.

In [ ]:
df[df['W']>0]

1. on kaggle -> get csv file of titanic

2. import on google colab

3. Display the imported data

4. Slice data to extract only the Womans of the passengers

**Importing dataframe (.CSV) from Kaggle to Google Colab** **& Displaying the data**

In [28]:
# Importing titanic dataset CSV from Kaggle to dataframe
import pandas as pd

# After importing CSV data, display data by locating file location
list_of_titanic_passengers = pd.read_csv('tested.csv')
display(list_of_titanic_passengers)

     PassengerId  Survived  Pclass  ...      Fare Cabin  Embarked
0            892         0       3  ...    7.8292   NaN         Q
1            893         1       3  ...    7.0000   NaN         S
2            894         0       2  ...    9.6875   NaN         Q
3            895         0       3  ...    8.6625   NaN         S
4            896         1       3  ...   12.2875   NaN         S
..           ...       ...     ...  ...       ...   ...       ...
413         1305         0       3  ...    8.0500   NaN         S
414         1306         1       1  ...  108.9000  C105         C
415         1307         0       3  ...    7.2500   NaN         S
416         1308         0       3  ...    8.0500   NaN         S
417         1309         0       3  ...   22.3583   NaN         C

[418 rows x 12 columns]

**Analyzing Titanic Data by Sex**

In [30]:
sorted_values = list_of_titanic_passengers.sort_values("Sex")
display(sorted_values)

     PassengerId  Survived  Pclass  ...      Fare Cabin  Embarked
208         1100         1       1  ...   27.7208   A11         C
138         1030         1       3  ...    8.0500   NaN         S
330         1222         1       2  ...   36.7500   NaN         S
140         1032         1       3  ...   46.9000   NaN         S
141         1033         1       1  ...  151.5500   NaN         S
..           ...       ...     ...  ...       ...   ...       ...
167         1059         0       3  ...   34.3750   NaN         S
166         1058         0       1  ...   50.4958   B10         C
164         1056         0       2  ...   13.0000   NaN         S
131         1023         0       1  ...   28.5000   C51         C
417         1309         0       3  ...   22.3583   NaN         C

[418 rows x 12 columns]

**Filtering Titanic Data by Name & Sex**

In [45]:
name_sex = list_of_titanic_passengers[["Name", "Sex"]]
print(name_sex)

                                             Name     Sex
0                                Kelly, Mr. James    male
1                Wilkes, Mrs. James (Ellen Needs)  female
2                       Myles, Mr. Thomas Francis    male
3                                Wirz, Mr. Albert    male
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female
..                                            ...     ...
413                            Spector, Mr. Woolf    male
414                  Oliva y Ocana, Dona. Fermina  female
415                  Saether, Mr. Simon Sivertsen    male
416                           Ware, Mr. Frederick    male
417                      Peter, Master. Michael J    male

[418 rows x 2 columns]

**Analyzing Titanic data by Sex using Value Count**

In [72]:
list_of_titanic_passengers["Sex"].value_counts()
#Sex_map = {'female' = 0, 'male' = 1}
#list_of_female_passengers= list_of_titanic_passengers[list_of_titanic_passengers["Sex"]==0]
display(list_of_female_passengers)

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

**Saving the data treated from Titanic**

In [74]:
list_of_titanic_passengers.to_csv('file_name.csv')